[
  {
    "slug": "noiiz",
    "name": "Noiiz",
    "desc": "An unlimited catalogue of sounds: like Netflix but for music producers",
    "content": "<p><a href=\"https://www.noiiz.com/\"><strong>Noiiz</strong></a> is a Leeds startup that is revolutionising the world of music production by providing access to a vast catalogue of sounds & presets for a single subscription price. It's been featured in Music Tech Magazine, Sound On Sound and more, and has thousands of regular users.</p><p>We've been working with Noiiz since the very beginning, bootstrapping their technology with the Rails web app that powers their main catalogue. Now they have their own development team and we've been working closely with them to develop features and enhancements, and consulting on the best ways to scale the platform.</p><p>Some of the technical features we've introduced to Noiiz include:</p><ul><li>A search & filtering engine for the catalogue featuring PostgreSQL tsvector technology.</li><li>Deep integration with <a href=\"https://stripe.com/\">Stripe</a> for recurring payments.</li><li>Quota management for users on different subscription plans.</li><li>An in-browser audio player with waveform display.</li><li>\"Infinite\" scrolling on most pages.</li><li>Administration interface with spreadsheet upload functionality for adding new sounds to the catalogue.</li><li>A jobs worker that handles the background processing of sound metadata.</li><li>A variant user interface that is integrated directly into their DAW plugin.</li><li>A comprehensive test suite which now has over 800 test cases.</li></ul><p class=\"cta\"><a href=\"https://app.noiiz.com/\">Check out Noiiz</a></p><blockquote><p>\"Before Rich asked me if I’d mind writing a testimonial for his website, I had already planned to email him thanking him for everything he’s done for our company so far, so everything you read here would have been said anyway and I can honestly say there is no exaggeration or embellishment.</p><p>\"Rich is unlike any other developer we have ever worked with, in that he has that rare combination of technical excellence, crystal clear communication and customer empathy. His commitment to test driven development means your software will be stable and scaleable and his agile approach to scoping out features forces you, as a product owner, to better define how you think your software should work.</p><p>\"Rich also cares, a lot! Despite his expertise this is the one characteristic that has made working with him a real pleasure. His passion  is not just for coding, but making a difference in the world and that has been evident throughout our working relationship.</p><p>\"We’re looking forward to working with Rich more in the future and kind of hope you don’t, so we can have him all to ourself!\"</p><p>– <strong>David Rose</strong>, CEO</p></blockquote>"
  },
  {
    "slug": "gigappy",
    "name": "Gigappy",
    "desc": "An app to get bands and touring musicians organising gigs painlessly",
    "content": "<p><a href=\"http://gigappy.com/\"><strong>Gigappy</strong></a> is a web-based social network specifically designed with bands and touring musicians in mind. It helps band leaders organise gigs in a calendar, invite musicians and chat with them during the planning of the gig, and it allows band leaders to find musicians when they are needed.</p><p>Fish Percolator acts as a partner to Gigappy and so far we've been responsible for all the development work on the Rails app that powers it.</p><p>Some technical features we've implemented include:</p><ul><li>Sign in with Facebook.</li><li>Runs as a <a href=\"https://developers.google.com/web/progressive-web-apps/\">PWA</a> on compatible devices, meaning it can be installed as though it was a mobile app.</li><li>Real-time notification system.</li><li>Invite management system with detailed access controls so users can only see gigs they are meant to see.</li></ul><p>Gigappy is currently a public beta and is still in active development. You're very welcome to join it!</p><p class=\"cta\"><a href=\"https://app.gigappy.com/\">Sign into Gigappy</a></p>"
  },
  {
    "slug": "digitalurban",
    "name": "Digital Urban",
    "desc": "The place for local authorities and architects to collaborate on 3D models",
    "content": "<p><a href=\"https://digitalurban.com/\"><strong>Digital Urban</strong></a> is a platform for local authorities, architects and the creators of 3D models to collaborate on open digital models of cities. It presents the downloadable models and their metadata in the form of a map, which users can navigate through in order to find the models or info they need.</p><p>Fish Percolator acts as a partner on this project, which is still in the early stages of collecting and storing the content.</p><p>Features of note that we've implemented in the Rails-based web app so far include:</p><ul><li>Browsable map with geometric areas and colour-coded markers, with clustering.</li><li>KML upload of polygons in the administrative interface.</li><li>Machine-readable versions of the data that will be used to populate 3D technology automatically.</li><li>One-time download URLs to files stored in <a href=\"https://aws.amazon.com/s3/\">Amazon S3</a>.</li><li>Access-controlled administrative interface, where local authorities can modify their own data, but not other people's.</li></ul><p class=\"cta\"><a href=\"https://app.digitalurban.com/\">Browse Digital Urban</a></p>"
  },
  {
    "slug": "careview",
    "name": "Careview",
    "desc": "One click to help identify socially isolated citizens - working with the NHS and Leeds City Council",
    "content": "<img class=\"logo\" src=\"/clients/usdl.png\" alt=\"Urban Sustainable Development Lab logo\" /><p><a href=\"https://leeds.care.vu/\"><strong>Careview</strong></a> is a project developed by the <a href=\"http://sustainabledevelopmentlab.com/\">Urban Sustainable Development Lab</a>, of which Fish Percolator is a member. This Rails-based mobile web app allows citizens to report instances of neglect in the built environment, which are aggregated together into a heatmap. The intention is to help frontline services identify socially isolated citizens, testing a hypothesis that these two things are connected.</p><p>Careview uses the user's phone geolocation to allow the reporting of this information in a single click, on a large colourful heart on the home screen.</p><p>The project was funded by a grant from NHS England is is being developed in collaboration with Leeds City Council. It's currently the subject of a major evaluation in Leeds, involving researchers and frontline staff.</p><p>Some things we developed for Careview include:</p><ul><li>Runs as a <a href=\"https://developers.google.com/web/progressive-web-apps/\">PWA</a> on compatible devices, meaning it can be installed as though it was a mobile app.</li><li>Geolocation - it uses your phone's current location to add data to the heatmap.</li><li>A custom Google heatmap for presenting the data in a usable and anonymised way.</li><li>Very small data footprint so it can be used by users on restricted data plans.</li><li>Verification system when users sign up for a new account.</li></ul><p>Careview is currently the subject of a closed trial, but please do ask for a demo if you'd like to see it in action.</p>"
  },
  {
    "slug": "crisis-dashboard",
    "name": "Crisis Dashboard",
    "desc": "A Leeds City Council project to help the victims of domestic violence",
    "content": "<img class=\"logo\" src=\"/clients/usdl.png\" alt=\"Urban Sustainable Development Lab logo\" /><p><strong>Crisis Dashboard</strong> is a project developed by the <a href=\"http://sustainabledevelopmentlab.com/\">Urban Sustainable Development Lab</a>, of which Fish Percolator is a member. It is an Android application developed for Leeds City Council, which provides a specific service to victims of domestic violence.</p><p>Because of the sensitive nature of this project, it is not possible to provide too many details about it in this public portfolio, but we’d be happy to talk about this privately if you’d like to know more.</p><p class=\"cta\"><a href=\"http://sustainabledevelopmentlab.com/2016/08/05/software-can-create-social-impact-but-only-if-it-is-sympathetic-to-the-intricacies-of-our-lives/\">Read more on the USDL blog</a></p>"
  },
  {
    "slug": "sampleism",
    "name": "Sampleism DB"
  },
  {
    "slug": "recolor",
    "name": "Recolor.ink"
  },
  {
    "slug": "revelry",
    "name": "Revelry"
  },
  {
    "slug": "william-hill-cloud",
    "name": "William Hill Cloud"
  },
  {
    "slug": "wordpress-plugins",
    "name": "WordPress plugins"
  },
  {
    "slug": "fpsite",
    "name": "This website"
  },
  {
    "slug": "community",
    "name": "Open source"
  }
]
