[
  {
    "slug": "noiiz",
    "name": "Noiiz",
    "desc": "An unlimited catalogue of sounds: like Netflix but for music producers",
    "content": "<p><a href=\"https://www.noiiz.com/\"><strong>Noiiz</strong></a> is a Leeds startup that is revolutionising the world of music production by providing access to a vast catalogue of sounds & presets for a single subscription price. It's been featured in Music Tech Magazine, Sound On Sound and more, and has thousands of regular users.</p><p>We've been working with Noiiz since the very beginning, bootstrapping their technology with the Rails web app that powers their main catalogue. Now they have their own development team and we've been working closely with them to develop features and enhancements, and consulting on the best ways to scale the platform.</p><p>Some of the technical features we've introduced to Noiiz include:</p><ul><li>A search & filtering engine for the catalogue featuring PostgreSQL tsvector technology.</li><li>Deep integration with <a href=\"https://stripe.com/\">Stripe</a> for recurring payments.</li><li>Quota management for users on different subscription plans.</li><li>An in-browser audio player with waveform display.</li><li>\"Infinite\" scrolling on most pages.</li><li>Administration interface with spreadsheet upload functionality for adding new sounds to the catalogue.</li><li>A jobs worker that handles the background processing of sound metadata.</li><li>A variant user interface that is integrated directly into their DAW plugin.</li><li>A comprehensive test suite which now has over 800 test cases.</li></ul><p class=\"cta\"><a href=\"https://app.noiiz.com/\">Check out Noiiz</a></p><blockquote><p>\"Before Quinn asked me if I’d mind writing a testimonial for their website, I had already planned to email them thanking them for everything they've done for our company so far, so everything you read here would have been said anyway and I can honestly say there is no exaggeration or embellishment.</p><p>\"Quinn is unlike any other developer we have ever worked with, in that they have that rare combination of technical excellence, crystal clear communication and customer empathy. Their commitment to test driven development means your software will be stable and scaleable and their agile approach to scoping out features forces you, as a product owner, to better define how you think your software should work.</p><p>\"Quinn also cares, a lot! Despite their expertise this is the one characteristic that has made working with them a real pleasure. Their passion is not just for coding, but making a difference in the world and that has been evident throughout our working relationship.</p><p>\"We’re looking forward to working with Quinn more in the future and kind of hope you don’t, so we can have them all to ourself!\"</p><p>– <strong>David Rose</strong>, CEO</p></blockquote>"
  },
  {
    "slug": "careview",
    "name": "Careview",
    "desc": "One click to help identify socially isolated citizens - working with the NHS and Leeds City Council",
    "content": "<img class=\"logo\" src=\"/clients/usdl.png\" alt=\"Urban Sustainable Development Lab logo\" /><p><a href=\"https://leeds.care.vu/\"><strong>Careview</strong></a> is a project developed by the <a href=\"http://sustainabledevelopmentlab.com/\">Urban Sustainable Development Lab</a>, of which Fish Percolator is a member. This Rails-based mobile web app allows citizens to report instances of neglect in the built environment, which are aggregated together into a heatmap. The intention is to help frontline services identify socially isolated citizens, testing a hypothesis that these two things are connected.</p><p>Careview uses the user's phone geolocation to allow the reporting of this information in a single click, on a large colourful heart on the home screen.</p><p>The project was funded by a grant from NHS England and is being developed in collaboration with Leeds City Council. A major evaluation in Leeds, involving researchers and frontline staff resulted in successful funding from the European Space Agency. Careview is now operating in three cities in the UK and poised to expand to the rest of Europe.</p><div style=\"padding:56.25% 0 0 0;position:relative;\"><iframe src=\"https://player.vimeo.com/video/261013384?title=0&byline=0&portrait=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div><script src=\"https://player.vimeo.com/api/player.js\"></script><p>Some things we developed for Careview include:</p><ul><li>Runs as a <a href=\"https://developers.google.com/web/progressive-web-apps/\">PWA</a> on compatible devices, meaning it can be installed as though it was a mobile app.</li><li>Geolocation - it uses your phone's current location to add data to the heatmap.</li><li>A custom Google heatmap for presenting the data in a usable and anonymised way.</li><li>Very small data footprint so it can be used by users on restricted data plans.</li><li>Verification system when users sign up for a new account.</li></ul><p>Careview is currently operating in three cities in the UK, but please do ask for a demo if you'd like to see it in action and maybe consider using it for your city.</p><p class=\"cta\"><a href=\"https://apolitical.co/solution_article/leeds-is-fighting-loneliness-with-an-app-and-a-map/\">Read about Careview on Apolitical</a></p><p class=\"cta\"><a href=\"https://duke-studios.com/news/article/duke-residents-collaborate-on-smart-city-social-isolation-project\">Read about Careview on the Duke Studios blog</a></p>"
  },
  {
    "slug": "commscanner",
    "name": "Commscanner",
    "desc": "Track your online and offline communications with one dashboard",
    "content": "<p><a href=\"https://commscanner.com/\"><strong>Commscanner</strong></a> is a new venture from Leeds branding legends BML Creative. Organisations with complex marketing campaigns can create unique short URLs and for each channel (whether print or digital) and then track the performance - and value for money - of each channel in one dashboard.</p><p>We built the technology for Commscanner using Rails and a very highly customized installation of <a href=\"https://activeadmin.info/\">Active Admin</a>, which gave us a headstart on implementing the core features in a very short space of time. It also features:</p><ul><li>QR code generation</li><li>Data history capture and graphs</li><li>PDF report generation (using <a href=\"http://prawnpdf.org/\">Prawn PDF</a>)</li><li>Multi-tenancy with a dedicated short URL domain name for each tenant</li></ul><p>If Commscanner sounds good for your business, you can sign up for a trial on their website.</p><p class=\"cta\"><a href=\"https://commscanner.com/\">Register your interest</a></p>"
  },
  {
    "slug": "tailormade",
    "name": "Tailormade",
    "desc": "Capturing the imaginations of food designers",
    "content": "<p><b><a href=\"https://mytailormade.app/\">Tailormade by Pecan Deluxe</a></b> is a unique web and mobile (PWA) app, made for <a href=\"https://pecandeluxe.com/\">Pecan Deluxe</a>, one of the world's major creators of confectionery for food manufacturers.</p><p>It helps food designers to capture their inspiration whenever it strikes by providing them with a Pinterest-style 'mood board' for things like the colour, taste and shape of the ingredient they want designing.</p><p>Tailormade is a fully responsive app that works equally well on desktop or mobile, and includes the following features:</p><ul><li>Image upload from your device or directly from the web</li><li>Automated image resizing and rotation</li><li><a href=\"https://masonry.desandro.com/\">Masonry</a>-based tiling of images</li><li>Printable briefs with a dedicated printer stylesheet</li><li>Sharing between members of the same organisation but access restricted to members of other organisations</li></ul><p>Tailormade was made in only 2 weeks of development time and features designs by Jamie Donaldson of <a href=\"https://outpost.studio/\">Outpost</a>."
  },
  {
    "slug": "gigappy",
    "name": "Gigappy",
    "desc": "An app to get bands and touring musicians organising gigs painlessly",
    "content": "<p><a href=\"http://gigappy.com/\"><strong>Gigappy</strong></a> is a web-based social network specifically designed with bands and touring musicians in mind. It helps band leaders organise gigs in a calendar, invite musicians and chat with them during the planning of the gig, and it allows band leaders to find musicians when they are needed.</p><p>Fish Percolator acts as a partner to Gigappy and so far we've been responsible for all the development work on the Rails app that powers it.</p><p>Some technical features we've implemented include:</p><ul><li>Sign in with Facebook.</li><li>Runs as a <a href=\"https://developers.google.com/web/progressive-web-apps/\">PWA</a> on compatible devices, meaning it can be installed as though it was a mobile app.</li><li>Real-time notification system.</li><li>Invite management system with detailed access controls so users can only see gigs they are meant to see.</li></ul><p>Gigappy is currently a public beta and is still in active development. You're very welcome to join it!</p><p class=\"cta\"><a href=\"https://app.gigappy.com/\">Sign into Gigappy</a></p>"
  },
  {
    "slug": "digitalurban",
    "name": "Digital Urban",
    "desc": "The place for local authorities and architects to collaborate on 3D models",
    "content": "<p><a href=\"https://digitalurban.com/\"><strong>Digital Urban</strong></a> is a platform for local authorities, architects and the creators of 3D models to collaborate on open digital models of cities. It presents the downloadable models and their metadata in the form of a map, which users can navigate through in order to find the models or info they need.</p><p>Fish Percolator acts as a partner on this project, which is still in the early stages of collecting and storing the content.</p><p>Features of note that we've implemented in the Rails-based web app so far include:</p><ul><li>Browsable map with geometric areas and colour-coded markers, with clustering.</li><li>KML upload of polygons in the administrative interface.</li><li>Machine-readable versions of the data that will be used to populate 3D technology automatically.</li><li>One-time download URLs to files stored in <a href=\"https://aws.amazon.com/s3/\">Amazon S3</a>.</li><li>Access-controlled administrative interface, where local authorities can modify their own data, but not other people's.</li></ul><p class=\"cta\"><a href=\"https://app.digitalurban.com/\">Browse Digital Urban</a></p>"
  },
  {
    "slug": "aces",
    "name": "ACes",
    "desc": "Bespoke evaluation software for Armstrong Cameron",
    "content": "<p><strong>ACes</strong> (Armstrong Cameron evaluation software) is the digital component of <a href=\"http://armstrongcameron.com/\">Armstrong Cameron</a> - experts in evaluating projects in the arts and cultural space.</p><p>A bespoke solution allows for much deeper integration, branding and only relevant features for the evaluation process, which has already been proven to work through many successful projects in the past.</p><p>ACes is a mobile-first Rails database app with various exciting features that are still under wraps right now.</p><p>If you have a project that needs independent evaluation, and the idea of experienced evaluators with their own tech sounds interesting, <a href=\"http://armstrongcameron.com/\">get in touch with Armstrong Cameron</a>.</p>"
  },
  {
    "slug": "crisis-dashboard",
    "name": "Crisis Dashboard",
    "desc": "A Leeds City Council project to help the victims of domestic violence",
    "content": "<img class=\"logo\" src=\"/clients/usdl.png\" alt=\"Urban Sustainable Development Lab logo\" /><p><strong>Crisis Dashboard</strong> is a project developed by the <a href=\"http://sustainabledevelopmentlab.com/\">Urban Sustainable Development Lab</a>, of which Fish Percolator is a member. It is an Android application developed for Leeds City Council, which provides a specific service to victims of domestic violence.</p><p>Because of the sensitive nature of this project, it is not possible to provide too many details about it in this public portfolio, but we’d be happy to talk about this privately if you’d like to know more.</p><p class=\"cta\"><a href=\"http://sustainabledevelopmentlab.com/2016/08/05/software-can-create-social-impact-but-only-if-it-is-sympathetic-to-the-intricacies-of-our-lives/\">Read more on the USDL blog</a></p>"
  },
  {
    "slug": "fanserve",
    "name": "FanServe",
    "desc": "Progressive Web App for ordering food at football matches",
    "content": "<p><a href=\"https://fanserve.co.uk/\"><strong>FanServe</strong></a> is a startup that aims to bring mobile phone priority food ordering to football stadiums, by offering an ordering experience tailored to the timings of sports.</p><p>The app allows consumers to quickly choose items from a menu, then select where they'd like to pick them up and whether before the game or at half time. Chefs at kiosks are given a tablet-based realtime view on all orders in progress with one click to change the status of an order.</p><p>FanServe offers a full Progressive Web App experience with a frontend created in <a href=\"https://nuxtjs.org/\">Nuxt</a> &amp; <a href=\"https://vuetifyjs.com/en/\">Vuetify</a> that behaves as a full mobile app in the browser, only downloading data from the Rails-API-based backend when it needs updates.</p><p class=\"cta\"><a href=\"https://fanserve.co.uk/\">Visit the FanServe marketing site</a></p>"
  },
  {
    "slug": "mog",
    "name": "MoGian calendar",
    "desc": "JavaScript library to convert between Gregorian and MoGian dates",
    "content": "<p>The <a href=\"https://twitter.com/themofginger\"><strong>Ministry of Ginger</strong></a> is a creative entity that is challenging our collective understanding of international law. It has its own calendar that is a radical departure from the Gregorian calendar used by most countries.</p><p>We built a frontend JavaScript library for converting a Gregorian date to a MoGian date. The library was built using ES7 with a Webpack toolchain and features:</p><ul><li>Automated installation into elements with a specific class</li><li>An integrated calendar-picker widget based on <a href=\"https://github.com/Pikaday/Pikaday\">Pikaday</a></li><li>A full programming interface for fine-grained control</li><li>Embedded CSS using <a href=\"https://github.com/webpack-contrib/css-loader\">css-loader</a></li><li>No external dependencies</li></ul><p class=\"cta\"><a href=\"https://fishpercolator.co.uk/mogian.js\">Read the documentation</a></p>"
  },
  {
    "slug": "maple",
    "name": "Maple",
    "desc": "Mapping Leeds: a dynamic web app for visualising Leeds datasets",
    "content": "<p><strong>Maple</strong> (<strong>Map</strong>ping <strong>Le</strong>eds) is a browser-based app for visualising datasets of Leeds geographic data.</p><p>It contains two tools: a ward map, which shows a numeric dataset as relative intensities of Leeds's 33 wards, and a postcode map which displays a heatmap given a list of postcodes in the city.</p><p>It was commissioned by <a href=\"https://timetoshineleeds.org/\">Time to Shine</a> for their datasets, but it can be used for all kinds of Leeds datasets, from election results to the locations of pedestrian crossings.</p><p>Maple was developed entirely in <A href=\"https://vuejs.org/\">Vue.js</a> in 2 days and runs in the browser with no server-side components at all.</p><p>Features of this app include:</p><ul><li>A hybrid of open data and the Google Maps API.</li><li>A fully reactive interface: maps redraw whenever any field changes.</li><li>Auto-saving using browser local storage.</li><li>A mechanism for downloading the map as an image using the mystical <a href=\"https://html2canvas.hertzen.com/\">html2canvas</a>.</li></ul><p>Maple is best viewed on a desktop in the Chrome browser, as it uses a number of cutting-edge browser features.</p><p class=\"cta\"><a href=\"https://www.fishpercolator.co.uk/maple/\">Try Maple for yourself</a></p>"
  },
  {
    "slug": "sampleism",
    "name": "Sampleism DB",
    "desc": "Migration of database & data from one cloud provider to another",
    "content": "<p>Online store <a href=\"https://www.sampleism.com/\"><strong>Sampleism</strong></a> hired Fish Percolator to work on a very technical problem. They were building a new website using conventional technologies and needed to get all the data out of their existing platform so it could be loaded into their new one.</p><p>The previous platform was based on the proprietary NoSQL technology of one cloud provider, and a complex migration app needed to be developed in Rails to fully extract all of this data into a more conventional SQL format that could be used on the new cloud provider.</p><p>The finer details of this backend project are of course internal to Sampleism, but please let us know if we can help you with any similar projects!</p>"
  },
  {
    "slug": "recolor",
    "name": "Recolor.ink",
    "desc": "Tiny web app for recolouring vector graphics with drag and drop, written in Crystal",
    "content": "<p>We built <a href=\"https://recolor.ink/\"><strong>Recolor.ink</strong></a> to solve a frequent problem we were having when building software: vector graphics for user interfaces are usually black, and many user interfaces need them to be other colours.</p><p>This tiny web app allows you to pick a colour, then drag and drop your black images and download the newly recoloured versions.</p><p>Features of Recolor.ink include:</p><ul><li>Developed using the lightning-fast <a href=\"https://crystal-lang.org/\">Crystal</a> programming language and the <a href=\"http://kemalcr.com/\">Kemal</a> web framework.</li><li>Webpack-based JavaScript frontend that uses <a href=\"http://www.dropzonejs.com/\">Dropzone</a> and <a href=\"http://bgrins.github.io/spectrum/\">Spectrum</a></li><li>No storage backend for the uploaded files - they're delivered in-browser using data URIs.</li></ul><p class=\"cta\"><a href=\"https://recolor.ink/\">Check out Recolor.ink</a></p>"
  },
  {
    "slug": "revelry",
    "name": "Revelry",
    "desc": "Toolkit for building presentations quickly using Reveal.js",
    "content": "<p><strong>Revelry</strong> is a toolkit for making presentations in code using the amazing <a href=\"https://revealjs.com/\">Reveal.js</a> by Hakim El Hattab. We built it because we really dislike PowerPoint and wanted something as pleasant as MkDocs or LaTeX for quickly coding up flashy presentations.</p><p class=\"cta\"><a href=\"https://medium.com/@fishpercolator/death-to-powerpoint-presentations-in-code-1b5e30f16b3a\">Read the blog post about it</a></p><p class=\"cta\"><a href=\"https://github.com/fishpercolator/revelry/blob/master/README.md\">Get started with the README</a></p><p>To learn more about Revelry, visit <a href=\"https://storage.fishpercolator.co.uk/presentations/revelry/\"><strong>this introductory presentation</strong></a> written using Revelry (and its <a href=\"https://github.com/fishpercolator/revelry-demo/\">source code</a>)</p><blockquote><p>I needed a way to use Reveal.js for a large corporate project that would make it easy to add or modify small sections without the code becoming too unwieldy. Since the content was being changed frequently, I was also hoping to use an HTML templating system like Jade, and SASS compilation to speed up development.</p><p>Revelry to the rescue! One command in the terminal to build the project instantly. I could never have done it without Revelry. And Quinn was super helpful by adding in some features which helped make this project a success.</p><p>– <strong>Maureen Dunlap</strong>, Sr. Front End Developer, VIF International Education</p></blockquote>"
  },
  {
    "slug": "william-hill-cloud",
    "name": "William Hill Cloud",
    "desc": "Helping develop an internal cloud for the major gambling company",
    "content": "<p>Fish Percolator was on contract to <a href=\"https://www.williamhillplc.com/\"><strong>William Hill</strong></a> in 2015, helping to develop the William Hill Cloud software, a proprietary application deployment platform used throughout the organization.</p><p>Much of this work was spent integrating the backend of William Hill Cloud with <a href=\"http://fog.io/\">Fog.io</a>, the Ruby cloud services library, with many contributions back to the project, resulting in Fish Percolator's Quinn <a href=\"https://github.com/fog/fog/blob/master/CHANGELOG.md\">being named the MVP of Fog.io version 1.37</a>.</p><p>Job management was done using Resque, and during this time we contributed a gem – <a href=\"https://github.com/William-Hill-Online/resque-status-future\">resque-status-future</a> – that adds <em>future</em> support to the resque-status library.</p><blockquote><p>\"Quinn worked in my team for around 6 months and proved themself to be an exceptional developer, with a keen eye for detail. They produced good, well tested code and in the course of their brief time here contributed patches to a number of open source projects, notably the Fog.io project that merged in their various patches in short order. I would highly recommend Quinn.\"</p><p>– <strong>Anthony Roy</strong>, Development Lead</p></blockquote>"
  },
  {
    "slug": "wordpress-plugins",
    "name": "WordPress plugins",
    "desc": "Fixing up issues or missing functionality in third-party plugins",
    "content": "<p>We've been hired a number of times by our neighbours <a href=\"https://madebyanalogue.co.uk/\"><strong>Analogue</strong></a> to make some technical changes to WordPress plugins that they've been using with their clients' websites.</p><p>These changes have included:</p><ul><li>Deep integration of the Events Manager plugin into the user interface of the <a href=\"http://leedsindiefood.co.uk/\">Leeds Indie Food</a> website.</li><li>Various changes to the Booked plugin to make it match the booking needs of <a href=\"https://www.theginstitute.com/\">The Ginstitute</a>.</li><li>Removing/tweaking unexpected UI in the Pinpoint plugin used by <a href=\"https://the-distillery.london/\">The Distillery</a>.</li></ul><p>If you have a misbehaving plugin in any content-management system (not just WordPress), we'd be happy to take a look at fixing it up for you.</p>"
  },
  {
    "slug": "fpsite",
    "name": "This website",
    "desc": "A Vue.js showcase following internet best practices",
    "content": "<p>When we first started, we had a WordPress website like everyone else out there. But that didn't seem a very <em>Fish Percolator</em> thing to do, so we built this website you're looking at.</p><p>The Fish Percolator website, as well as having a unique look, is a showcase of modern JavaScript and internet best practices. Its features include:</p><ul><li>Built entirely using the amazing <a href=\"https://vuejs.org/\">Vue.js</a> JavaScript framework, which knocks React and friends out of the park.</li><li>Statically generated as a <a href=\"https://nuxtjs.org/\">Nuxt</a> application, and hosted on <a href=\"https://pages.github.com/\">GitHub Pages</a> to take advantage of their CDN and http/2 support, and to allow it to be crawled by search engines.</li><li>Full adherence to modern web standards and accessibility, with a 96/100/100/100/100 score on <a href=\"https://developers.google.com/web/tools/lighthouse/\">Google Lighthouse</a>.</li><li>A fancy radial menu control, adapted to Vue from <a href=\"https://codepen.io/bennettfeely/pen/qRJOZJ\">a concept by Bennett Feely</a>.</li><li>Auto-generation of the multi-tabbed portfolio page from a JSON config file.</a></li><li>A <a href=\"https://developers.google.com/web/progressive-web-apps/\">PWA</a>, allowing it to be installed as an app on modern Android devices for offline browsing.</li></ul><p class=\"cta\"><a href=\"https://github.com/fishpercolator/fpsite\">Browse the source code</a></p>"
  },
  {
    "slug": "community",
    "name": "Open source",
    "desc": "Examples of code we've contributed to the community",
    "content": "<p>We're huge fans of the <a href=\"https://opensource.org/\"><strong>open source</strong></a> movement, and we use open source code every single day we are building software.</p><p>Open source only works when people give back, and we give back as often as we can. Some of the contributions we're most proud of include:</p><ul><li>Many contributions to <a href=\"http://fog.io/\">fog.io</a> that resulted in Quinn being named the project's MVP for release 1.37</li><li><a href=\"https://github.com/codegram/spinach/pull/194\">Adding an audit mode to the Spinach testing tool</a></li><li><a href=\"https://github.com/thoughtbot/administrate/pull/971\">Adding authorization features to the Administrate library</a></li><li><a href=\"https://github.com/thoughtbot/administrate/pull/1020\">Adding support for editing polymorphic fields to Administrate</a></li><li><a href=\"https://github.com/rails/rails/pull/31082\">A small but significant contribution to the core of Rails itself</a></li><li><a href=\"https://rubygems.org/gems/administrate-field-lat_lng\">A gem that adds latitude and longitude field types to Administrate</li><li><a href=\"https://github.com/rcaelers/workrave/pull/73\">Fixing a Linux-specific issue with Workrave</a>, a C++ app that helps prevent RSI</li></ul><p class=\"cta\"><a href=\"https://github.com/pedantic-git\">Check out Quinn on GitHub</a></p>"
  }
]
