[
  {
    "slug": "collaboration",
    "name": "Collaboration",
    "img_desc": "Fish in teacups having a conversation",
    "description": "Developing software is a team effort: it can't be done in a vacuum.\n\nWhen we build software, we keep two-way dialogue open with you, so that we can share prototypes, exchange ideas and make sure we stay on the same page at all times.\n\nBefore each iteration, we formalise requirements *together* with you, so that there are no big surprises on delivery day.\n\n**Consultation is always free**: we don't believe in charging you before you know if we're the right fit."
  },
  {
    "slug": "honesty",
    "name": "Honesty & humour",
    "img_desc": "Person with a percolator and a speech bubble containing a fish",
    "description": "It's easy for software developers to adopt the 'car mechanic' approach and keep you in the dark about how hard something is or why something costs what it does. Honesty is so important to us: we want to make sure you understand *why* and *how* things work, both in terms of development and in the way we do business.\n\nWe're huge fans of Plain English, and this is reflected in our communication style and even our contracts.\n\nWe're in this to have fun, and we want you to have fun working with us too. So apologies in advance for all the Twin Peaks and Kate Bush references."
  },
  {
    "slug": "testing",
    "name": "Regression testing",
    "img_desc": "Two percolators marked with a cross and a tick",
    "description": "Software isn't finished when the first version is delivered. Every release adds new features and functionality.\n\nThat's why regression testing is so important to us: we build automated tests into every iteration of a product so that you can be sure the *old* features are still working whenever we create new ones.\n\n[You can read more about this on our blog](https://medium.com/@fishpercolator/regression-testing-or-why-the-fastest-developers-might-not-be-the-best-ones-4c2992e37c03)."
  },
  {
    "slug": "scalability",
    "name": "Horizontal scalability",
    "img_desc": "A wide percolator with an eel",
    "description": "When you're running a business you need to know it can cope as your userbase grows. Software designed on a small scale is often useless once you reach thousands of users and results in costly rewrites.\n\nWe build web applications to the [Twelve-Factor specification](https://12factor.net/), which means they are designed to grow as your userbase grows, without the need for rewriting. Applications built to this specification are also highly portable, and can equally run on the tiniest virtual server or a scalable cloud like [Heroku](https://www.heroku.com/)."
  },
  {
    "slug": "iterative",
    "name": "Iterative development",
    "img_desc": "A percolator and three successively larger fish",
    "description": "We don't believe in big six-month projects with all the requirements agreed up-front. With software, it's hard to know what comes next until you and your users have seen and used what's been done so far.\n\nWe develop iteratively, typically doing around 35-40 hours' work on a project at a time. At the end of a phase, you'll have working software you can play with and give to your users, and then we can design the next phase together.\n\nThis also helps us charge appropriately: when a small set of requirements for a phase has been agreed up-front, we can also set a fixed price for that phase, so there are no nasty surprises at the end."
  },
  {
    "slug": "legacy",
    "name": "Leaving a positive legacy",
    "img_desc": "A lattice of hexagons, with a fish percolator in the middle",
    "description": "A piece of software is a living work: development doesn't stop when you launch it to customers. There will always be updates, new features and new customers.\n\nCode written by agencies often bears the label 'legacy code', sure to strike fear into the hearts of any new developers you recruit to work on it in the future.\n\nWe're extremely aware of this and so we try to create the most reusable and portable code possible, following practices like convention-over-configuration, the Twelve-Factor specification and behaviour-driven development, all of which will help anything we make for you fit into your ecosystem as comfortably as it can."
  },
  {
    "slug": "trackrecord",
    "name": "Proven success stories",
    "img_desc": "A percolator winning the gold medal in a sporting event",
    "description": "A swanky website isn't going to cut it when you're picking a developer for your next big business idea. You need evidence that we are who we say we are.\n\nAnd for that, please take a look at our extensive portfolio. We've done work from the smallest little tweaks to the applications that back entire tech businesses, underpinned by over 15 years' industry experience.\n\n> \"Rich is unlike any other developer we have ever worked with, in that he has that rare combination of technical excellence, crystal clear communication and customer empathy.\"\n> — David Rose, CEO of Noiiz"
  },
  {
    "slug": "conscience",
    "name": "A social conscience",
    "img_desc": "A percolator protesting with a fish placard",
    "description": "We make no secret of our political convictions: we're here to make software that benefits humanity, even in small ways. We're not going to sell ourselves out, and that means we're not going to sell you out either.\n\nIt's said that *software reproduces oppression unless it is explicitly designed not to*. It's easy to miss things like systemic bias or inaccessbility when designing software, and we'll be there trying our hardest to point them out when we see them in designs, or consult with the affected group.\n\nWe also believe government should be there to protect the vulnerable, and to that end we pay all our taxes, whether or not they are spent wisely by the people in power."
  }
]
